**Estudo pandas parte 2**

**pydataset ( importa alguns datasets de exemplo do formato de dataframe do pandas)**

In [1]:
import pydataset
# mostrando os datadets disponiveis usando o head para nao ficar com a lista toda
pydataset.data().head()

      dataset_id                                        title
0  AirPassengers  Monthly Airline Passenger Numbers 1949-1960
1        BJsales            Sales Data with Leading Indicator
2            BOD                    Biochemical Oxygen Demand
3   Formaldehyde                Determination of Formaldehyde
4   HairEyeColor    Hair and Eye Color of Statistics Students

In [2]:
# carregando um dataset da lista
titanic = pydataset.data("titanic")

# com o comando head e possivel pegar so o comeco de um dataframe
titanic.head()

       class     age  sex survived
1  1st class  adults  man      yes
2  1st class  adults  man      yes
3  1st class  adults  man      yes
4  1st class  adults  man      yes
5  1st class  adults  man      yes

In [3]:
# assim como na serie e possivel pegar informacoes gerais do dataframe com describe
titanic.describe()

            class     age   sex survived
count        1316    1316  1316     1316
unique          3       2     2        2
top     3rd class  adults   man       no
freq          706    1207   869      817

In [4]:
# contando valores de uma coluna
titanic['class'].value_counts()

3rd class    706
1st class    325
2nd class    285
Name: class, dtype: int64

**Carregando dados de um banco no dataframe do pandas com db.py**

Este cara permite que vc carregue dados do banco diretamente do dataframe do panda (desde que vc tenha o driver correto para tanto e um banco suportado) a titulo de exemplo vou usar o "banco de teste" da ferramenta.

In [5]:
from db import DemoDB # or connect to your own using DB. see below
db = DemoDB() # comes from: http://chinookdatabase.codeplex.com/
db.tables

Indexing schema. This will take a second...finished!
Refreshing schema. Please wait...done!

+--------+---------------+----------------------------------------------------------------------------------+
| Schema | Table         | Columns                                                                          |
+--------+---------------+----------------------------------------------------------------------------------+
| public | Album         | AlbumId, Title, ArtistId                                                         |
| public | Artist        | ArtistId, Name                                                                   |
| public | Customer      | CustomerId, FirstName, LastName, Company, Address, City, State, Country, PostalC |
|        |               | ode, Phone, Fax, Email, SupportRepId                                             |
| public | Employee      | EmployeeId, LastName, FirstName, Title, ReportsTo, BirthDate, HireDate, Address, |
|        |               |  City, State, Country, PostalCode, Phone, Fax, Email                             |
| public | Genre         | GenreId, Name                                                                    |
| public | Invoice       | InvoiceId, CustomerId, InvoiceDate, BillingAddress, BillingCity, BillingState, B |
|        |               | illingCountry, BillingPostalCode, Total                                          |
| public | InvoiceLine   | InvoiceLineId, InvoiceId, TrackId, UnitPrice, Quantity                           |
| public | MediaType     | MediaTypeId, Name                                                                |
| public | Playlist      | PlaylistId, Name                                                                 |
| public | PlaylistTrack | PlaylistId, TrackId                                                              |
| public | Track         | TrackId, Name, AlbumId, MediaTypeId, GenreId, Composer, Milliseconds, Bytes, Uni |
|        |               | tPrice                                                                           |
+--------+---------------+----------------------------------------------------------------------------------+

In [6]:
# recuperando uma tabela como dataframe
customer_df = db.tables.Customer.all()
# mostrando coluna customer name
customer_df['FirstName'].head()

0         Luís
1       Leonie
2     François
3        Bjørn
4    František
Name: FirstName, dtype: object

In [7]:
# recuperendo dados a partir de uma query utilizando templastes

q = """
SELECT
    firstname,lastname
FROM
    {{ name }}
"""
querydata = [
  {"name": "Customer"},
  
]

query_result = db.query(q,data=querydata)
print(query_result.head())

   FirstName     LastName
0       Luís    Gonçalves
1     Leonie       Köhler
2   François     Tremblay
3      Bjørn       Hansen
4  František  Wichterlová

<br>**carregando um csv com pandas**

In [8]:
# existem milhares de parametros mas basicamente ....
import pandas as pd

pd.read_csv('res/sample.csv',delimiter=";")

   valores1  valores2  valores3
0        10        20        30
1        40        50        60
2         7        80        90

<br>**Carregando excel com pandas (atencao para a dependencia do xlrd)**

In [9]:
pd.read_excel('res/sample_spreadsheet.xls')   #csv('res/sample.csv',delimiter=";")

        Nome  Valor
0       Enzo    100
1      Joao      37
2     Valdir    300
3  Jucicreia      2

<br>**Trabalhando com filtros no Pandas**

In [10]:
import pydataset
infert = pydataset.data('infert')
infert.columns
#presidents_dataset.index['time']
#infert.head()

#pydataset.data()

Index(['education', 'age', 'parity', 'induced', 'case', 'spontaneous',
       'stratum', 'pooled.stratum'],
      dtype='object')

In [11]:
# verificando  dados de uma coluna
infert['age'].describe()

count    248.000000
mean      31.504032
std        5.251565
min       21.000000
25%       28.000000
50%       31.000000
75%       35.250000
max       44.000000
Name: age, dtype: float64

In [12]:
# verificando linhas com idade > que quarenta anos ( retorna todas as linhas com um true / false)
infert['age'] >40

1      False
2       True
3      False
4      False
5      False
       ...
244    False
245    False
246    False
247    False
248    False
Name: age, Length: 248, dtype: bool

In [13]:
# mesmo filtro so que ao inves de retornar todos os registros com as flags so retornarei os registros que forem verdadeiros
infert.loc[infert['age'] > 40]

,education,age,parity,induced,case,spontaneous,stratum,pooled.stratum
2,0-5yrs,42,1,1,1,0,2,1
20,6-11yrs,44,1,0,1,1,20,17
33,6-11yrs,42,1,1,1,0,33,16
43,6-11yrs,41,1,0,1,0,43,15
85,0-5yrs,42,1,0,0,0,2,1
103,6-11yrs,44,1,0,0,0,20,17
116,6-11yrs,42,1,1,0,0,33,16
126,6-11yrs,41,1,0,0,0,43,15
167,0-5yrs,42,1,0,0,0,2,1
185,6-11yrs,44,1,1,0,0,20,17
198,6-11yrs,42,1,0,0,0,33,16
208,6-11yrs,41,1,0,0,0,43,15

<br>**Vantagem de trabalhar com dados categoricos no pandas**

In [15]:
dstitanic= pydataset.data('titanic')
dstitanic.columns

Index(['class', 'age', 'sex', 'survived'], dtype='object')

In [16]:
#Verificando o tamanho em bytes da coluna class
dstitanic['class'].nbytes

10528

In [18]:
%%time
# Calculando o tempo de filtrar todos os ocupantes da terceira classe
dstitanic['class']=='3rd class'

CPU times: user 561 µs, sys: 47 µs, total: 608 µs
Wall time: 614 µs

1       False
2       False
3       False
4       False
5       False
        ...
1312     True
1313     True
1314     True
1315     True
1316     True
Name: class, Length: 1316, dtype: bool

In [19]:
## formatando a coluna class como um tipo categorico
dstitanic['class']=dstitanic['class'].astype('category')

In [20]:
## Tamanho da coluna como novo tipo de dado
dstitanic['class'].nbytes

1340

In [21]:
%%time
# Calculando novamente o tempo de filtrar todos os ocupantes da terceira classe
dstitanic['class']=='3rd class'

CPU times: user 447 µs, sys: 28 µs, total: 475 µs
Wall time: 411 µs

1       False
2       False
3       False
4       False
5       False
        ...
1312     True
1313     True
1314     True
1315     True
1316     True
Name: class, Length: 1316, dtype: bool

<br>**Trabalhando com dados perdidos**

In [29]:
## supondo o dataset abaixo com dados incompletos
import numpy as np

dados = {
        'nome': ['João', 'Maria', 'José', np.nan, 'Pedro', 'Judas', 'Tiago'],
        'sexo': ['M', 'F', 'M', np.nan, 'M', 'M', np.nan],
        'idade': [14, 13, np.nan, np.nan, 15, 13, 14],
        'nota': [4, 10, 7, np.nan, 8, 9, np.nan],
    }
dfdados = pd.DataFrame(dados)

In [30]:
dfdados

    nome sexo  idade  nota
0   João    M   14.0   4.0
1  Maria    F   13.0  10.0
2   José    M    NaN   7.0
3    NaN  NaN    NaN   NaN
4  Pedro    M   15.0   8.0
5  Judas    M   13.0   9.0
6  Tiago  NaN   14.0   NaN

In [32]:
# dropando todas as colunas com um NaN
dfdados.dropna()

    nome sexo  idade  nota
0   João    M   14.0   4.0
1  Maria    F   13.0  10.0
4  Pedro    M   15.0   8.0
5  Judas    M   13.0   9.0

In [34]:
#limpando as linhas em que todas as colunas estejam problematicas
dfdados.dropna(how='all')

    nome sexo  idade  nota
0   João    M   14.0   4.0
1  Maria    F   13.0  10.0
2   José    M    NaN   7.0
4  Pedro    M   15.0   8.0
5  Judas    M   13.0   9.0
6  Tiago  NaN   14.0   NaN

In [36]:
## supondo uma coluna de valores NaN
dfdados['serie']=np.nan
dfdados

    nome sexo  idade  nota  serie
0   João    M   14.0   4.0    NaN
1  Maria    F   13.0  10.0    NaN
2   José    M    NaN   7.0    NaN
3    NaN  NaN    NaN   NaN    NaN
4  Pedro    M   15.0   8.0    NaN
5  Judas    M   13.0   9.0    NaN
6  Tiago  NaN   14.0   NaN    NaN

In [37]:
## poderiamos excluir a mesma utilizando
dfdados.dropna(how='all',axis=1)

    nome sexo  idade  nota
0   João    M   14.0   4.0
1  Maria    F   13.0  10.0
2   José    M    NaN   7.0
3    NaN  NaN    NaN   NaN
4  Pedro    M   15.0   8.0
5  Judas    M   13.0   9.0
6  Tiago  NaN   14.0   NaN

In [39]:
## tambem eh possivel estabelecer um threshold para eliminar dados com um numero x de campos
dfdados.dropna(thresh=3)

    nome sexo  idade  nota  serie
0   João    M   14.0   4.0    NaN
1  Maria    F   13.0  10.0    NaN
2   José    M    NaN   7.0    NaN
4  Pedro    M   15.0   8.0    NaN
5  Judas    M   13.0   9.0    NaN

In [44]:
## uma outra possibilidade eh preencher os campos vazios da coluna com um valor qualquer 
#(EH PRECISO COLOCAR O INPLACE DO CONTRARIO VC SO TERA A COLUNA SEM ALTERAR O DF)
dfdados['serie'].fillna(8,inplace=True)
dfdados

    nome sexo  idade  nota  serie
0   João    M   14.0   4.0    8.0
1  Maria    F   13.0  10.0    8.0
2   José    M    NaN   7.0    8.0
3    NaN  NaN    NaN   NaN    8.0
4  Pedro    M   15.0   8.0    8.0
5  Judas    M   13.0   9.0    8.0
6  Tiago  NaN   14.0   NaN    8.0